package week07.leetcode.editor.cn;
 
//请你判断一个 9x9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。 
//
// 
// 数字 1-9 在每一行只能出现一次。 
// 数字 1-9 在每一列只能出现一次。 
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图） 
// 
//
// 数独部分空格内已填入了数字，空白格用 '.' 表示。 
//
// 注意： 
//
// 
// 一个有效的数独（部分已被填充）不一定是可解的。 
// 只需要根据以上规则，验证已经填入的数字是否有效即可。 
// 
//
// 
//
// 示例 1： 
//
// 
//输入：board = 
//[["5","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：true
// 
//
// 示例 2： 
//
// 
//输入：board = 
//[["8","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：false
//解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无
//效的。 
//
// 
//
// 提示： 
//
// 
// board.length == 9 
// board[i].length == 9 
// board[i][j] 是一位数字或者 '.' 
// 
// Related Topics 哈希表 
// 👍 523 👎 0

import java.util.HashSet;
import java.util.Set;

//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    //1.数组
//    public boolean isValidSudoku(char[][] board) {
//        boolean[][] row = new boolean[9][9];
//        boolean[][] col = new boolean[9][9];
//        boolean[][] box = new boolean[9][9];
//        for(int i = 0;i<9;i++){
//            for(int j = 0;j<9;j++){
//                if(board[i][j] != '.'){
//                    int num = board[i][j] - '1';
//                    if(row[i][num]){
//                        return false;
//                    }
//                    if(col[j][num]){
//                        return false;
//                    }
//                    int idx = (i / 3) * 3 + j / 3;
//                    if(box[idx][num]){
//                        return false;
//                    }
//                    row[i][num] = true;
//                    col[j][num] = true;
//                    box[idx][num] = true;
//                }
//            }
//        }
//        return true;
//    }

    //2.集合
    public boolean isValidSudoku(char[][] board) {
        Set<Integer>[] row = new Set[9];
        Set<Integer>[] col = new Set[9];
        Set<Integer>[] box = new Set[9];
        for(int i = 0;i<9;i++){
            row[i] = new HashSet<Integer>();
            col[i] = new HashSet<Integer>();
            box[i] = new HashSet<Integer>();
        }
        for(int i = 0;i<9;i++){
            for(int j = 0;j<9;j++){
                if(board[i][j] != '.'){
                    int num = board[i][j] - '1';
                    if(!row[i].add(num)){
                        return false;
                    }
                    if(!col[j].add(num)){
                        return false;
                    }
                    int idx = (i / 3) * 3 + j / 3;
                    if(!box[idx].add(num)){
                        return false;
                    }
                }
            }
        }
        return true;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
